/**
 * Created by QAQ on 2016/6/25 0025.
 */
var gv={
    jd_color:"#0a0",
    jd_color2:"#ddd",
    bg_color:"#fff",
    offset:[0,-650],
    position: {//[x,y,size] size=small/middle/large
        1:[201, 614, "small","入门"],//
        2:[263, 583, "small","基础"],//
        3:[292, 493, "middle","暴力"],//
        4:[277, 657, "middle","排序"],//
        5:[338, 577, "middle","贪心"],//
        6:[196, 496, "middle","迭代"],//
        7:[165, 695, "large","基础合集"],//
        8:[244, 409, "middle","递归"],//
        9:[123, 793, "middle"],//优化
        10:[347, 747, "small"],//高级排序
        11:[90, 732, "small"],//二分
        12:[45, 788, "small"],//三分

        13:[270,753,"small"],//分治
        14:[119,558,"middle"],//模拟
        15:[216,803,"small"],//位运算
        50:[113,652,"small"],//字符串
        51:[44,683,"small"],//KMP
        52:[50,608,"small"],//马拉车

        101:[90,873,"small"],//数据结构入门
        110:[34,937,"middle"],//链结构
        111:[18,1027,"small"],//栈
        112:[91,1015,"small"],//队列
        120:[165,874,"middle"],//树结构
        121:[156,975,"small"],//优先队列
        122:[226,958,"small"],//并查集
        123:[294,951,"small"],//线段树
        124:[260,871,"small"],//树状数组
        125:[373,982,"small"],//字典树
        126:[345,890,"middle"],//平衡树
        102:[317,819,"small"],//哈希表

        201:[373,670,"small"],//数学入门
        211:[416,736,"small"],//素数
        212:[489,723,"small"],//同余
        213:[393,807,"small"],//唯一分解
        214:[463,791,"small"],//GCD
        215:[432,871,"small"],//欧拉函数
        216:[500,852,"small"],//扩展GCD
        217:[538,780,"small"],//快速幂
        218:[527,921,"small"],//逆元
        219:[570,854,"small"],//米勒罗宾
        220:[459,940,"small"],//中国剩余
        231:[518,656,"small"],//概率论入门
        241:[445,662,"small"],//组合入门
        251:[591,645,"small"],//矩阵入门
        252:[562,710,"small"],//矩阵的基本运算
        253:[609,771,"small"],//矩阵快速幂
        254:[632,701,"small"],//高斯消元

        501:[336,422,"small"],//搜索入门
        502:[297,330,"middle"],//DFS
        503:[395,355,"middle"],//BFS
        504:[368,262,"middle"],//搜索剪枝
        505:[259,208,"large"],//搜索合集

        601:[140,440,"small"],//DP入门
        602:[72,400,"small"],//线性DP
        603:[72,480,"small"],//背包问题
        604:[4,355,"small"],//树状DP
        605:[143,360,"small"],//区间DP
        606:[72,320,"small"],//概率DP
        607:[4,440,"small"],//状压DP

        999:[]
    },
    draggable:false
};